src/cf/InformationRegisters/уатШтрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатШтрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПаллеты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.уатВнутреннееПеремещение</v8:Type>
						<v8:Type>cfg:DocumentRef.уатИнвентаризацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПотребностьВПеревозке_уэ</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаявкаНаРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:CatalogRef.уатГрузовыеМеста_уэ</v8:Type>
						<v8:Type>cfg:DocumentRef.уатВыдачаРасходныхМатериалов</v8:Type>
						<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.уатТехнологическийПутевойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатВозвратТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказГрузоотправителя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПотребностьВПеревозке_уэ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonForms/уатФормаПоискаПоТрекНомеру/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		уатОбщегоНазначенияКлиент.ОбработатьСобытиеПодключаемогоОборудования(ИмяСобытия, Параметр, Источник);
	КонецЕсли;
	// Конец ПодключаемоеОборудование
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура ВыполнитьПоиск(Команда) 
	
	РезультатПоиска = ПоискОбъектовПоТрекНомеру(ВведеннаяСтрокаПоиска); 
	
	Если ТипЗнч(РезультатПоиска) = Тип("Строка") Тогда  
		ПоказатьПредупреждение(,РезультатПоиска);
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(РезультатПоиска) = Тип("ДокументСсылка.уатЗаказГрузоотправителя") 
		ИЛИ ТипЗнч(РезультатПоиска) = Тип("ДокументСсылка.уатПотребностьВПеревозке_уэ") Тогда
		СсылкаНаДокумент = РезультатПоиска;
	КонецЕсли;
		
	уатОбщегоНазначенияКлиент.ОбработатьПолучениеОбъектаПоШтрихкоду(СсылкаНаДокумент, ЭтаФорма);
		
КонецПроцедуры

#КонецОбласти 


#Область СлужебныеПроцедурыИФункции 

&НаСервереБезКонтекста
Функция ПоискОбъектовПоТрекНомеру(ТрекНомер)
	
	Запрос = Новый Запрос();
	// Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//               |	уатШтрихкоды.Объект КАК Объект,
	//               |	уатШтрихкоды.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
	//               |	уатШтрихкоды.Штрихкод КАК Штрихкод,
	//               |	ВЫБОР
	//               |		КОГДА ТИПЗНАЧЕНИЯ(уатШтрихкоды.ЗаказГрузоотправителя) = ТИП(Документ.уатЗаказГрузоотправителя)
	//               |			ТОГДА 1
	//               |		ИНАЧЕ 2
	//               |	КОНЕЦ КАК Приоритет
	//               |ИЗ
	//               |	РегистрСведений.уатШтрихкоды КАК уатШтрихкоды
	//               |ГДЕ
	//               |	уатШтрихкоды.Штрихкод ПОДОБНО ""%"" + &Штрихкод + ""%""
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	Приоритет";
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	уатШтрихкоды.Объект КАК Объект,
	               |	уатШтрихкоды.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
	               |	уатШтрихкоды.Штрихкод КАК Штрихкод,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(уатШтрихкоды.ЗаказГрузоотправителя) = ТИП(Документ.уатЗаказГрузоотправителя)
	               |			ТОГДА 1
	               |		ИНАЧЕ 2
	               |	КОНЕЦ КАК Приоритет
	               |ИЗ
	               |	РегистрСведений.уатШтрихкоды КАК уатШтрихкоды
	               |ГДЕ
	               |	уатШтрихкоды.Штрихкод = &Штрихкод
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Приоритет";
	
	Запрос.УстановитьПараметр("Штрихкод", ТрекНомер); 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Если ЗначениеЗаполнено(Выборка.ЗаказГрузоотправителя) Тогда
			СсылкаНаДокумент = Выборка.ЗаказГрузоотправителя;
		Иначе
			СсылкаНаДокумент = Выборка.Объект;
		КонецЕсли;
		
		Возврат СсылкаНаДокумент;
		
	Иначе 	
		ТекстСообщения = НСтр("ru = 'По данному трек-номеру объектов не обнаружено'; en = 'No objects were found with this tracking number.'");
		Возврат ТекстСообщения;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
